Revit 2026 API

# FabricationNetworkChangeServiceChangeSize Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId> selection,
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
```
```vb
Public Function ChangeSize (
	selection As ISet(Of ElementId),
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap)
) As FabricationNetworkChangeServiceResult
```
```cpp
public:
FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId^>^ selection,
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
```
```fsharp
member ChangeSize :
        selection : ISet<ElementId> *
        fabricationPartSizeMaps : ISet<FabricationPartSizeMap> -> FabricationNetworkChangeServiceResult
```

#### Parameters

selection ISetElementId

fabricationPartSizeMaps ISetFabricationPartSizeMap

#### Return Value

FabricationNetworkChangeServiceResult

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace